Repository: youmtinet-flutter-apps/thumbnails_youtube
Catalog: lib/l10n/intl_*.arb
Languages: fr

# appTitle
source: Thumbnails YouTube
fr: Miniatures YouTube

# videoLoadError
source: An error occurred while loading the video
fr: Une erreur s'est produite lors du chargement de la vidéo

# errorTitle
source: Error
fr: Erreur

# infoTitle
source: Info
fr: Infos

source: Invalid URL
fr: URI non valide

# pasteYoutubeUrlHint
source: Paste a YouTube URL
fr: Collez une URL YouTube

source: Open full quality
fr: Ouvrir en pleine résolution

# resolutionLabel
source: Resolution
fr: Résolution

# downloadSuccess
source: Image downloaded successfully!
fr: Image téléchargée avec succès !

source: Watch on YouTube
fr: Regarder sur YouTube

# youtubeOpenFailed
source: Could not open YouTube
fr: Impossible d'ouvrir YouTube

# adsDialogTitle
source: Advertisement
fr: Publicité

# adsDialogMessage
source: An ad will be displayed before loading the video
fr: Une publicité va être affichée avant de charger la vidéo

source: Loading...
fr: Chargement...

# errorWithReason
source: Error: {reason}
fr: Erreur : {reason}

# historyTitle
source: Full history
fr: Historique complet

# youtubeUrlDetected
source: YouTube URL detected and pasted!
fr: URL YouTube détectée et collée !

# pasteUrlHereHint
source: Paste YouTube URL here...
fr: Collez l'URL YouTube ici...

source: Paste from Clipboard
fr: Coller depuis le presse-papiers

source: Fetch Thumb
fr: Récupérer la miniature

source: Community Hub
fr: Hub communautaire

# viewsLabel
source: {count} views
fr: {count} vues

# viralVideoThumbnail
source: Viral Video Thumbnail {number}
fr: Miniature vidéo virale {number}

source: MaxRes Preview
fr: Aperçu MaxRes

source: Select Quality
fr: Sélectionnez la qualité

source: Launch Video in YouTube
fr: Ouvrir la vidéo sur YouTube

source: Save to Gallery
fr: Enregistrer dans la galerie
